micropython/micropython/ports/mimxrt/machine_encoder.c
#if FSL_FEATURE_SOC_ENC_COUNT > 1

__attribute__((section(".ram_functions"))) void ENC2_IRQHandler(void) {
    irq_callback(1);
}

#if FSL_FEATURE_SOC_ENC_COUNT > 2
__attribute__((section(".ram_functions"))) void ENC3_IRQHandler(void) {
    irq_callback(2);
}

__attribute__((section(".ram_functions"))) void ENC4_IRQHandler(void) {
    irq_callback(3);
}
#endif
#endif

static void mp_machine_encoder_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_encoder_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->mode == MODE_ENCODER) {
        int32_t min = (int32_t)self->min_count;
        if (min > 0) {
            min += (self->phases_inv - 1);
        }
        int32_t max = (int32_t)self->max_count;
        if (max > 0) {
            max += (self->phases_inv - 1);
        }
        int32_t match = (int32_t)self->enc_config.positionCompareValue;
        if (match > 0) {
            match += (self->phases_inv - 1);
        }
        mp_printf(print, "<Encoder %d, phases=%d, max=%ld, min=%ld, match=%ld, filter=%luns>\n",
            self->id, 4 / self->phases_inv,
            max / self->phases_inv, min / self->phases_inv,
            match / self->phases_inv, self->filter);
    } else {
        mp_printf(print, "<Counter %d, max=%ld, min=%ld, match=%ld, filter=%luns>\n",
            self->id, self->max_count, self->min_count,
            self->enc_config.positionCompareValue, self->filter);
    }
}

// Utility functions
//

static void encoder_set_iomux(const machine_pin_obj_t *pin, const machine_pin_af_obj_t *af) {
    IOMUXC_SetPinMux(pin->muxRegister, af->af_mode, af->input_register, af->input_daisy, pin->configRegister, 0U);
    IOMUXC_SetPinConfig(pin->muxRegister, af->af_mode, af->input_register, af->input_daisy, pin->configRegister, 0x10B0U);
}

// decode the AF objects module and Port numer. Returns NULL if it is not a XBAR object
static const machine_pin_af_obj_t *af_name_decode_xbar(const machine_pin_af_obj_t *af_obj,
    xbar_input_signal_t *io_number) {
    const char *str;
    size_t len;
    size_t xlen = XBAR_STRING_LEN;
    str = (char *)qstr_data(af_obj->name, &len);
    // test for the name starting with XBAR
    if (len < (xlen + 2) || strncmp(str, XBAR_STRING, xlen) != 0) {
        return NULL;
    }
    // Get I/O number, e.g. XBAR_INOUT03
    *io_number = (str[xlen] - '0') * 10 + (str[xlen + 1] - '0');
    return af_obj;
}

static const machine_pin_af_obj_t *find_xbar_af(const machine_pin_obj_t *pin, xbar_input_signal_t *io_number) {
    const machine_pin_af_obj_t *af = NULL;
    for (int i = 0; i < pin->af_list_len; ++i) {
        af = af_name_decode_xbar(&(pin->af_list[i]), io_number);
        if (af != NULL) {
            return af;
        }
    }
    mp_raise_ValueError(MP_ERROR_TEXT("invalid input Pin"));
}

static uint8_t connect_pin_to_encoder(mp_obj_t desc, xbar_output_signal_t encoder_signal, uint8_t direction) {
    xbar_input_signal_t xbar_pin;
    const machine_pin_obj_t *pin = pin_find(desc);
    const machine_pin_af_obj_t *af = find_xbar_af(pin,  &xbar_pin);
    encoder_set_iomux(pin, af);
    if (direction == XBAR_IN) {
        XBARA_SetSignalsConnection(XBARA1, xbar_pin, encoder_signal);
    } else {
        // No API here, so do basic Register access.
        #if defined MIMXRT117x_SERIES
        if (xbar_pin >= XBAR_OUT_MIN && xbar_pin <= XBAR_OUT_MAX) {
            if (xbar_pin < XBAR_ENC_DIR_OFFSET_2) {
                IOMUXC_GPR->XBAR_ENC_DIR_REGISTER_1 |= 1 << (xbar_pin - XBAR_ENC_DIR_OFFSET_1);
                XBARA_SetSignalsConnection(XBARA1, encoder_signal, xbar_pin);
            } else {
                IOMUXC_GPR->XBAR_ENC_DIR_REGISTER_2 |= 1 << (xbar_pin - XBAR_ENC_DIR_OFFSET_2);
                XBARA_SetSignalsConnection(XBARA1, encoder_signal, xbar_pin);
            }
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("invalid match Pin"));
        }
        #else
        if (xbar_pin >= XBAR_OUT_MIN && xbar_pin <= XBAR_OUT_MAX) {
            IOMUXC_GPR->XBAR_ENC_DIR_REGISTER |= 1 << (xbar_pin + XBAR_ENC_DIR_OFFSET); // Compare the offset 12 with other MCU
            XBARA_SetSignalsConnection(XBARA1, encoder_signal, xbar_pin);
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("invalid match Pin"));
        }
        #endif  // defined MIMXRT117x_SERIES
    }
    return xbar_pin;
}

static void clear_encoder_registers(machine_encoder_obj_t *self) {
    // Create a High pulse on the Trigger input, clearing Position, Revolution and Hold registers.
    XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputLogicHigh, xbar_signal_table[self->id].enc_home);
    XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputLogicLow, xbar_signal_table[self->id].enc_home);
    if (self->home_pin) {
        connect_pin_to_encoder(self->home_pin, xbar_signal_table[self->id].enc_home, XBAR_IN);
    }
}

//
// Functions for configuring the ENC Device
//
// Calculate the filter parameters based on a filter_ns value, telling the shortest
// pulse that will be detected.
//
static uint32_t calc_filter(uint32_t filter_ns, uint16_t *count, uint16_t *period) {

    #if defined MIMXRT117x_SERIES
    uint32_t freq_khz = CLOCK_GetRootClockFreq(kCLOCK_Root_Bus) / 1000;
    #else
    uint32_t freq_khz = CLOCK_GetIpgFreq() / 1000;
    #endif

    uint32_t cycles = (filter_ns * (freq_khz / 1000)) / 1000;
    if (cycles == 0) {
        // Set filter off
        *count = 0;
        *period = 0;
    } else {
        uint16_t pmax = cycles / 10;
        if (pmax > 255) {
            pmax = 255;
        }
        if (pmax == 0) {
            pmax = 1;
        }
        uint16_t cnt;
        cnt = cycles / pmax;
        if (cnt > 10) {
            cnt = 10;
        }
        *count = cnt >= 3 ? cnt - 3 : 0;
        *period = pmax;
    }
    return ((1000000000 / freq_khz) + 1) * (*count + 3) * *period / 1000;
}

// MicroPython API functions
//
static void mp_machine_encoder_init_helper_common(machine_encoder_obj_t *self,
    mp_arg_val_t args[], enc_config_t *enc_config) {

    enum { ARG_home, ARG_match, ARG_match_pin, ARG_filter_ns, ARG_max, ARG_min, ARG_signed, ARG_index };

