micropython/micropython/ports/mimxrt/machine_encoder.c
    // Check for a Home pin, resetting the counters
    if (args[ARG_home].u_obj != MP_ROM_INT(-1)) {
        if (args[ARG_home].u_obj != mp_const_none) {
            self->home_pin = args[ARG_home].u_obj;
            connect_pin_to_encoder(self->home_pin, xbar_signal_table[self->id].enc_home, XBAR_IN);
            self->enc_config.HOMETriggerMode = kENC_HOMETriggerOnRisingEdge;
        } else {
            XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputLogicLow, xbar_signal_table[self->id].enc_home);
            self->home_pin = NULL;
        }
    }

    // Check for a Match pin for the compare match signal
    if (args[ARG_match_pin].u_obj != MP_ROM_INT(-1)) {
        if (args[ARG_match_pin].u_obj != mp_const_none) {
            self->match_pin = connect_pin_to_encoder(args[ARG_match_pin].u_obj, xbar_signal_table[self->id].enc_match, XBAR_OUT);
        } else {
            // Disconnect the XBAR from the output by switching it to an input.
            #if defined MIMXRT117x_SERIES
            if (self->match_pin < XBAR_ENC_DIR_OFFSET_2) {
                IOMUXC_GPR->XBAR_ENC_DIR_REGISTER_1 &= ~(1 << (self->match_pin - XBAR_ENC_DIR_OFFSET_1));
            } else {
                IOMUXC_GPR->XBAR_ENC_DIR_REGISTER_2 &= ~(1 << (self->match_pin - XBAR_ENC_DIR_OFFSET_2));
            }
            #else
            IOMUXC_GPR->XBAR_ENC_DIR_REGISTER &= ~(1 << (self->match_pin + XBAR_ENC_DIR_OFFSET));
            #endif
        }
    }

    if (args[ARG_match].u_obj != mp_const_none) {
        uint32_t compare = mp_obj_int_get_truncated(args[ARG_match].u_obj) * self->phases_inv;
        self->enc_config.positionCompareValue = compare;
        self->instance->LCOMP = (uint16_t)(compare) & 0xffff;        // Lower 16 pos bits.
        self->instance->UCOMP = (uint16_t)(compare >> 16U) & 0xffff; // Upper 16 pos bits.
    } else {
        // Set to the reset value
        self->enc_config.positionCompareValue = 0xFFFFFFFFU;
        self->instance->LCOMP = 0xffff;
        self->instance->UCOMP = 0xffff;
        // disable the interrupt to avoid false trigger
        ENC_DisableInterrupts(self->instance, kENC_PositionCompareInerruptEnable);
    }

    if (args[ARG_filter_ns].u_int >= 0) {
        self->filter = calc_filter(args[ARG_filter_ns].u_int,
            &(enc_config->filterCount), &(enc_config->filterSamplePeriod));
    }

    if (args[ARG_max].u_obj != mp_const_none) {
        self->max_count = mp_obj_int_get_truncated(args[ARG_max].u_obj) * self->phases_inv;
        self->is_signed = true;
    }

    if (args[ARG_min].u_obj != mp_const_none) {
        self->min_count = mp_obj_int_get_truncated(args[ARG_min].u_obj) * self->phases_inv;
        self->is_signed = true;
    }
    enc_config->positionModulusValue = self->max_count - 1;
    enc_config->positionInitialValue = self->min_count;
    enc_config->enableModuloCountMode = true;

    if (args[ARG_signed].u_int >= 0) {
        self->is_signed = !!args[ARG_signed].u_int;
    }

    // Count cycles on RollOverModulus or index pulse
    if (args[ARG_index].u_obj != MP_ROM_INT(-1)) {
        if (args[ARG_index].u_obj != mp_const_none) {
            connect_pin_to_encoder(args[ARG_index].u_obj, xbar_signal_table[self->id].enc_index, XBAR_IN);
            enc_config->revolutionCountCondition = kENC_RevolutionCountOnINDEXPulse;
            enc_config->INDEXTriggerMode = kENC_INDEXTriggerOnRisingEdge;
        } else {
            enc_config->revolutionCountCondition = kENC_RevolutionCountOnRollOverModulus;
            XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputLogicLow, xbar_signal_table[self->id].enc_index);
        }
    }

    // Initialize the ENC module and start
    ENC_Init(self->instance, enc_config);
    clear_encoder_registers(self);
    // Set the position and clear the rev register
    ENC_SetInitialPositionValue(self->instance, self->min_count);
    ENC_DoSoftwareLoadInitialPositionValue(self->instance);
    self->instance->REV = 0;
    ENC_ClearStatusFlags(self->instance, 0xff); // Clear all status flags
    self->active = true;
}

static void mp_machine_encoder_init_helper(machine_encoder_obj_t *self,
    size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_phase_a, ARG_phase_b, ARG_phases, ARG_home,
           ARG_match, ARG_match_pin, ARG_filter_ns, ARG_max, ARG_min, ARG_signed, ARG_index};

    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_phase_a, MP_ARG_OBJ, {.u_rom_obj = mp_const_none} },
        { MP_QSTR_phase_b, MP_ARG_OBJ, {.u_rom_obj = mp_const_none} },
        { MP_QSTR_phases, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_home, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_INT(-1)} },
        { MP_QSTR_match, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = mp_const_none} },
        { MP_QSTR_match_pin, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_INT(-1)} },
        { MP_QSTR_filter_ns, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_max, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = mp_const_none} },
        { MP_QSTR_min, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = mp_const_none} },
        { MP_QSTR_signed, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_index, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_INT(-1)} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args,
        MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // Process the Encoder specific keyword arguments
    // Get referred Pin object(s) and connect them to the encoder
    if (args[ARG_phase_a].u_obj != mp_const_none) {
        self->input_a = connect_pin_to_encoder(args[ARG_phase_a].u_obj, xbar_signal_table[self->id].enc_input_a, XBAR_IN);
    }
    if (args[ARG_phase_b].u_obj != mp_const_none) {
        self->input_b = connect_pin_to_encoder(args[ARG_phase_b].u_obj, xbar_signal_table[self->id].enc_input_b, XBAR_IN);
    }
    // Check for valid input pins
    if (self->input_a == 0 || self->input_b == 0 || self->input_a == self->input_b) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid or missing input pins"));
    }

    // Get the Phases argument
    if (args[ARG_phases].u_int != -1) {
        if ((args[ARG_phases].u_int != 1) && (args[ARG_phases].u_int != 2) && (args[ARG_phases].u_int != 4)) {
            mp_raise_ValueError(MP_ERROR_TEXT("invalid value for phases"));
        }
        self->phases_inv = 4 / args[ARG_phases].u_int;
    }

    // Set the common options
    mp_machine_encoder_init_helper_common(self, args + ARG_home, &self->enc_config);

    ENC_DoSoftwareLoadInitialPositionValue(self->instance); /* Update the position counter with initial value. */
}

// Qencoder(id, input_a, input_b, [args])
static mp_obj_t mp_machine_encoder_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    // Check number of arguments
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    CLOCK_EnableClock(kCLOCK_Iomuxc); // just in case it was not set yet
    XBARA_Init(XBARA1);

    uint8_t id = mp_obj_get_int(args[0]);
    if (id < 0 || id >= FSL_FEATURE_SOC_ENC_COUNT) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid encoder/counter id"));
    }
    // check, if the encoder is already in use, and if yes, dinit it
    if (encoder_table[id] != NULL) {
        encoder_deinit_single(encoder_table[id]);
    }

