micropython/micropython/ports/mimxrt/machine_encoder.c
    // Connect the trigger input to low level
    XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputLogicLow, xbar_signal_table[id].enc_trigger);

    // Create and populate the Qencoder object.
    machine_encoder_obj_t *self = m_new_obj(machine_encoder_obj_t);
    encoder_table[id] = self;
    self->id = id;
    self->input_a = 0;
    self->input_b = 0;
    self->base.type = &machine_encoder_type;
    self->instance = enc_instances[id + 1];
    self->max_count = 0;
    self->min_count = 0;
    self->mp_irq_flags = 0;
    self->mp_irq_trigger = 0;
    self->mp_irq_obj = NULL;
    self->match_pin = 0;
    self->is_signed = true;
    self->phases_inv = 4;  // default: phases = 1
    self->home_pin = NULL;
    self->mode = MODE_ENCODER;

    // Set defaults for ENC Config
    ENC_GetDefaultConfig(&self->enc_config);
    self->enc_config.revolutionCountCondition = kENC_RevolutionCountOnRollOverModulus;

    // Process the remaining parameters
    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
    mp_machine_encoder_init_helper(self, n_args - 1, args + 1, &kw_args);

    return MP_OBJ_FROM_PTR(self);
}

static void encoder_deinit_single(machine_encoder_obj_t *self) {
    if (self->active) {
        if (self->mp_irq_obj && self->mp_irq_obj->handler) {
            DisableIRQ(enc_irqn[self->id + 1]);
            ENC_DisableInterrupts(self->instance, ENCODER_ALL_INTERRUPTS);
        }
        if (self->match_pin != 0) {
            // Disconnect the XBAR from the output by switching it to an input.
            #if defined MIMXRT117x_SERIES
            if (self->match_pin < XBAR_ENC_DIR_OFFSET_2) {
                IOMUXC_GPR->XBAR_ENC_DIR_REGISTER_1 &= ~(1 << (self->match_pin - XBAR_ENC_DIR_OFFSET_1));
            } else {
                IOMUXC_GPR->XBAR_ENC_DIR_REGISTER_2 &= ~(1 << (self->match_pin - XBAR_ENC_DIR_OFFSET_2));
            }
            #else
            IOMUXC_GPR->XBAR_ENC_DIR_REGISTER &= ~(1 << (self->match_pin + XBAR_ENC_DIR_OFFSET));
            #endif
        }
        ENC_Deinit(self->instance);
    }
    self->active = false;
}

// encoder_deinit_all()
void machine_encoder_deinit_all(void) {
    for (int i = 0; i < ARRAY_SIZE(encoder_table); i++) {
        if (encoder_table[i] != NULL) {
            encoder_deinit_single(encoder_table[i]);
            encoder_table[i] = NULL;
        }
    }
}

// encoder.deinit()
static mp_obj_t machine_encoder_deinit(mp_obj_t self_in) {
    encoder_deinit_single(MP_OBJ_TO_PTR(self_in));
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_encoder_deinit_obj, machine_encoder_deinit);

// encoder.value([value])
static mp_obj_t machine_encoder_value(size_t n_args, const mp_obj_t *args) {
    machine_encoder_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    if (!self->active) {
        mp_raise_ValueError(MP_ERROR_TEXT("device stopped"));
    }
    uint32_t actual_value = ENC_GetPositionValue(self->instance);
    if (n_args > 1) {
        // Set the encoder position value and clear the rev counter.
        uint32_t value = mp_obj_int_get_truncated(args[1]) * self->phases_inv;
        clear_encoder_registers(self);
        // Set the position and rev register
        ENC_SetInitialPositionValue(self->instance, value);
        ENC_DoSoftwareLoadInitialPositionValue(self->instance);
        // Reset the INIT Value
        ENC_SetInitialPositionValue(self->instance, 0);
    }
    // Get the position as signed or unsigned 32 bit value.
    if (self->is_signed) {
        int32_t value = (int32_t)actual_value;
        if (value > 0) {
            value += (self->phases_inv - 1);
        }
        return mp_obj_new_int(value / self->phases_inv);
    } else {
        return mp_obj_new_int_from_uint((actual_value + (self->phases_inv - 1)) / self->phases_inv);
    }
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_encoder_value_obj, 1, 2, machine_encoder_value);

// encoder.cycles([value])
static mp_obj_t machine_encoder_cycles(size_t n_args, const mp_obj_t *args) {
    machine_encoder_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    if (!self->active) {
        mp_raise_ValueError(MP_ERROR_TEXT("device stopped"));
    }

    int16_t cycles = (int16_t)ENC_GetRevolutionValue(self->instance);
    if (n_args > 1) {
        // Set the revolution value
        self->instance->REV = mp_obj_get_int(args[1]);
    }
    return MP_OBJ_NEW_SMALL_INT(cycles);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_encoder_cycles_obj, 1, 2, machine_encoder_cycles);

// -------------------------------------- IRQ set-up --------------------------

static mp_uint_t encoder_irq_trigger(mp_obj_t self_in, mp_uint_t new_trigger) {
    machine_encoder_obj_t *self = MP_OBJ_TO_PTR(self_in);
    self->mp_irq_trigger = new_trigger;
    // Clear previous interrupts and enable the requested interrupts.
    ENC_ClearStatusFlags(self->instance, ENCODER_ALL_INTERRUPTS);
    ENC_DisableInterrupts(self->instance, ENCODER_ALL_INTERRUPTS);
    ENC_EnableInterrupts(self->instance, new_trigger);
    return 0;
}

static mp_uint_t encoder_irq_info(mp_obj_t self_in, mp_uint_t info_type) {
    machine_encoder_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (info_type == MP_IRQ_INFO_FLAGS) {
        return self->mp_irq_flags;
    } else if (info_type == MP_IRQ_INFO_TRIGGERS) {
        return self->mp_irq_trigger;
    }
    return 0;
}

static const mp_irq_methods_t encoder_irq_methods = {
    .trigger = encoder_irq_trigger,
    .info = encoder_irq_info,
};

// encoder.irq(trigger=ENCODER.IRQ_MATCH, handler=None, hard=False)
static mp_obj_t machine_encoder_irq(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    mp_arg_val_t args[MP_IRQ_ARG_INIT_NUM_ARGS];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_IRQ_ARG_INIT_NUM_ARGS, mp_irq_init_args, args);
    machine_encoder_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    bool any_args = n_args > 1 || kw_args->used != 0;

    if (!self->active) {
        mp_raise_ValueError(MP_ERROR_TEXT("device stopped"));
    }

